{
  "products": [
    {
      "id": "iB9P8kt2bis",
      "scientificName": "Begonia x corallina",
      "commonName": "Angel Wing Begonia",
      "overview": "The cane begonias are a group of Begonia cultivars. Their name derives from their tough, bamboo-like stems. They can grow up to 10 ft tall, which may necessitate staking.",
      "description": "Cane-type begonias are some of the best-performing and easiest begonias to grow. They are second only to wax begonias in their ease of culture, and second to none in their beauty. The most recognizable type of begonias are known as angel wing begonias. Native to Brazil, the plant grows on upright stems with interesting dotted leaves, unique colors, and a magnificent display of flowers. The plants are not particularly difficult to grow and can be planted and grown year-round indoors, providing you meet a few basic requirements. They'll grow at a moderately quick rate, with noticeable growth visible in just six weeks' time.",
      "size": "4in. Pot",
      "price": 95,
      "in_stock": true,
      "rating": 4,
      "best_seller": false,
      "rarity": "rare"
    },
    {
      "id": "enQ7lRYW-uU",
      "scientificName": "Epipremnum aureum",
      "commonName": "Snow Queen",
      "overview": "Keeping the Snow Queen pothos happy indoors is pretty straightforward. However, its care differs slightly from other pothos varieties like the golden pothos or Marble Queen pothos.",
      "description": "Epipremnum aureum as a general genus and species is native to Southeast Asia. I couldn’t find the exact origin of the snow queen variety, but my guess is that it’s somewhere around there. And it was probably a result of either a hybridized plant or a rando mutation that someone ran with. Snow queen pothos has the same familiar heart-shaped leaves that other epipremnum aureum pothos plants have. It vines and climbs, so it looks lovely in a hanging basket or climbing a moss pole. The thing that makes snow queen pothos unique and a bit more interesting than some other pothos plants, though, is its gorgeous variegation. The leaves are generally very light—nearly white—with green variegation and speckles on them. You might think, “Brittany, you’re talking about a marble queen pothos.” And I could be, because the marble queen pothos plant is very similar to the snow queen pothos plant. And it’s easy to confuse the two. But I own both, so let’s have a nosy at them!",
      "size": "6in. Pot",
      "price": 15,
      "in_stock": true,
      "rating": 5,
      "best_seller": true,
      "rarity": "common"
    },
    {
      "id": "hPVWVpZoQJw",
      "scientificName": "Ficus benjamina",
      "commonName": "Weeping Fig",
      "overview": "Commonly known as weeping fig, benjamin fig or ficus tree, and often sold in stores as just ficus, this is a species of flowering plant in the family Moraceae, native to Asia and Australia.",
      "description": "Weeping fig (Ficus benjamina's common name is known as the ficus tree) grows as a large broadleaf evergreen tree in tropical and subtropical climates, but it is more often grown as a houseplant in homes, offices, and featured in interior commercial landscaping. The ficus tree is known for its longevity, living between 20 to 50 years. This elegant plant has slender branches that arch gracefully from a light gray trunk, with dense, glossy dark leaves. When the Ficus benjamina tree is grown indoors, the plants are normally pruned to keep them about 3 feet to 6 feet tall, and their trunks are sometimes braided for decorative appeal. It is a fast grower and may need to be repotted up to once per year, but do so in the early spring for best results. Weeping fig is toxic to humans and pets.",
      "size": "4in. Pot",
      "price": 25,
      "in_stock": false,
      "rating": 4,
      "best_seller": true,
      "rarity": "common"
    },
    {
      "id": "N7oHWhK9UDM",
      "scientificName": "Senecio rowleyanus",
      "commonName": "String of Pearls",
      "overview": "This is a flowering plant in the daisy family Asteraceae. It is a creeping, perennial, succulent vine native to the drier parts of southwest Africa.",
      "description": "The string of pearls plant is not particular about its conditions. Given enough light and fertilizer, it will grow quite vigorously in a season. A single plant will survive for about five years if properly cared for, but if you propagate new plants from stem cuttings, you can effectively keep it alive indefinitely. To enable this plant to shine, consider growing string of pearls with multiple stems in a hanging basket. Its branches can also be intertwined, and you can also grow it in a dish, allowing it to form a terrestrial mat the way it does in the wild. String of pearls has no significant disease problems, and it doesn’t require much care. It does, however, need plenty of light all year.",
      "size": "4in. Pot",
      "price": 15,
      "in_stock": true,
      "rating": 5,
      "best_seller": false,
      "rarity": "common"
    },
    {
      "id": "buUOOaoUOQI",
      "scientificName": "Aglaonema Kiwi",
      "commonName": "Chinese Evergreen",
      "overview": "Aglaonema Kiwi is a sunworshipper and loves soaking up the rays. A compact clustering of green leaves with frills of white variegation, she looks good with very little effort.",
      "description": "Intense variegation and packed masses of foliage spread out from the centre of this gorgeous aglaonema variety. The leaves boast more creamy white variegation than green, and for that reason it can really flourish in that sunny spot by the window, unlike most of its shade loving cousins, where it will continue to grow brilliantly white. The green speckles that are found up the midrib and margins of the large leaves as well as across the stems work to highlight the striking brilliance of the main leaf body. This plant is found on rainforest floors around the world, and even in a packed out mass of plants it really stands out because of its unusual colouration.",
      "size": "6in. Pot",
      "price": 20,
      "in_stock": true,
      "rating": 5,
      "best_seller": false,
      "rarity": "common"
    },
    {
      "id": "OSBEqWnoDYo",
      "scientificName": "Scindapsus pictus",
      "commonName": "Satin Pothos",
      "overview": "This is a species of flowering plant in the arum family Araceae, native to India, Bangladesh, Thailand, Peninsular Malaysia, Borneo, Java, Sumatra, Sulawesi, and the Philippines.",
      "description": "Satin pothos (Scindapsus pictus), just like its botanical cousin pothos (Epipremnum aureum) is one of the easiest houseplants to grow. Both are members of the Arum family. They are evergreen tropical vines that are not cold-tolerant. That’s why pothos is usually grown indoors. What distinguishes satin pothos from pothos is the variegation of its foliage. The heart-shaped leaves have silvery grey splotches, which makes them look almost shiny and adds to the visual appeal of the plant. The intensity of the variegation depends on the cultivar. Satin pothos is a vine that will latch onto its surroundings—that can be a pole, a trellis, other plants, a wall, or a piece of furniture. The way the vine attaches to surfaces is through its aerial roots. Sometimes it does this on its own, sometimes it needs a little help, such as with invisible mini hooks. Instead of letting it trail, you can also grow satin pothos in a hanging planter allowing its foliage to cascade down.",
      "size": "4in. Pot",
      "price": 15,
      "in_stock": true,
      "rating": 4,
      "best_seller": false,
      "rarity": "common"
    },
    {
      "id": "MBsReSZ2WNM",
      "scientificName": "Dracaena trifasciata",
      "commonName": "Snake Plant",
      "overview": "This is a species of flowering plant in the family Asparagaceae, native to tropical West Africa from Nigeria to the Congo. It is commonly known as the snake plant, among other names.",
      "description": "Dracaena trifasciata, commonly known as the snake plant, is one of the most popular and hardy species of houseplants. Up until 2017, it was botanically classified as Sansevieria trifasciata, but its commonalities with Dracaena species were too many to overlook. The plant features stiff, sword-like leaves and can range anywhere from six inches to eight feet tall. Snake plants can vary in color although many have green-banded leaves and commonly feature a yellow border. These plants are easy to grow and, in many cases, are nearly indestructible. They will thrive in very bright light or almost dark corners of the house. Snake plants generally grow slowly in indoor light, but increasing its exposure to light will boost growth if it receives a few hours of direct sun. Planting and repotting is best done in the spring.",
      "size": "4in. Pot",
      "price": 30,
      "in_stock": true,
      "rating": 4,
      "best_seller": true,
      "rarity": "common"
    },
    {
      "id": "zTAcTi7D5i8",
      "scientificName": "Monstera deliciosa",
      "commonName": "Monstera Variegata",
      "overview": "Meet Monstera Variegata, the variegated Monstera! It’s got those same familiar jungle vibes, plus beautiful mottled foliage that really catch the eye.",
      "description": "This beautiful and unusual rare monstera plant is currently in high demand. Like most other variegated rare plants, it is also a slow grower and takes us years to grow it into a nice plant in a 5” pot. This is not a cutting like you see offered in many places online. White Variegated Monstera has leaves 13-18” wide with large holes resembling Swiss cheese (some people call it Swiss Cheese Plant). Each leaf is unique with no two the same. The irregular cream-and-green variegation creates some leaves that are nearly fully white with green markings and other leaves are green with white marbling. Aerial roots anchor it to a trellis, moss pole or wall. In its native habitat, it’s an understory plant that climbs up tropical trees. Mature plants produce breadfruit, an 8-10” long cone, that takes a year to mature into an edible fruit.",
      "size": "4in. Pot",
      "price": 200,
      "in_stock": false,
      "rating": 5,
      "best_seller": false,
      "rarity": "rare"
    },
    {
      "id": "8nONCr6eTeg",
      "scientificName": "Goeppertia insignis",
      "commonName": "Rattlesnake Plant",
      "overview": "Goeppertia insignis, the rattlesnake plant, is a species of flowering plant in the Marantaceae family, native to Rio de Janeiro state in Brazil.",
      "description": "Rattlesnake plant (Goeppertia insignis) is a tropical evergreen perennial native to Brazil, commonly grown as an indoor houseplant. It can be tricky to nurture, but if you give it the care it needs, you will be rewarded with an impressive display from the distinctive foliage with a wavy pattern along the edges and variegated with shades of greens. Even the undersides of the foliage are eye-catching with their beautiful purplish-red tones. In its native habitat, rattlesnake plant produces small yellow flowers in late spring. But as a houseplant, it is grown exclusively for its long, elegant, ornamental foliage, as it rarely blooms indoors. Plants typically grow to about 20 inches tall when grown as houseplants. Rattlesnake plant grows at a moderate rate indoors but will slow or stop growing if the plant is in unfavorable conditions.",
      "size": "4in. Pot",
      "price": 30,
      "in_stock": true,
      "rating": 4,
      "best_seller": true,
      "rarity": "common"
    },
    {
      "id": "bwsTJMnhcwE",
      "scientificName": "Monstera deliciosa",
      "commonName": "Swiss Cheese Plant",
      "overview": "Monstera deliciosa, the Swiss cheese plant or split-leaf philodendron is a species of flowering plant native to tropical forests of southern Mexico, south to Panama.",
      "description": "Monstera deliciosa, the Swiss cheese plant or split-leaf philodendron is a species of flowering plant native to tropical forests of southern Mexico, south to Panama. It has been introduced to many tropical areas, and has become a mildly invasive species in Hawaii, Seychelles, Ascension Island and the Society Islands",
      "size": "8in. Pot",
      "price": 80,
      "in_stock": true,
      "rating": 4,
      "best_seller": false,
      "rarity": "uncommon"
    },
    {
      "id": "uSlTcsT9lpo",
      "scientificName": "Alocasia Sanderiana Nobilis",
      "commonName": "Alocasia Nobilis",
      "overview": "This is a rare new cultivar that features dark green leaves with three main pointed corners, distinctive white veins, and jagged leaves all throughout forming a V-shape.",
      "description": "WOW -- breathtaking-- what else can be said about this incredibly rare and elusive Alocasia! Alocasia sanderiana 'Nobilis' features sharply pointed and deeply lobed leaves compared to the standard sanderiana species. Any serious plant or Aroid collector must-have plant. Alocasias come in a wide range of shapes & sizes from small statured Jewel Alocasias to leafy giants, but care is relatively the same for all plants in this genus!",
      "size": "4in. Pot",
      "price": 80,
      "in_stock": false,
      "rating": 4,
      "best_seller": false,
      "rarity": "rare"
    },
    {
      "id": "TNTZ9XRisjQ",
      "scientificName": "Ficus lyrata",
      "commonName": "Fiddle Leaf Fig",
      "overview": "Commonly known as the fiddle-leaf fig, this is a species of flowering plant in the mulberry and fig family Moraceae. It is native to western Africa's lowland tropical rainforest.",
      "description": "The fiddle-leaf fig (Ficus lyrata) is a popular indoor tree featuring very large, heavily veined, and glossy violin-shaped leaves that grow upright on a sleek trunk. A fiddle-leaf fig is perfect as a focal point of a room if you can situate it in a floor-standing container where the plant is allowed to grow to at least 6 feet tall. (Most indoor specimens reach around 10 feet tall.) It's a fairly fast grower and can be potted at any point in the year if you're like most gardeners acquiring a nursery plant to keep indoors. Keep in mind this gorgeous plant is toxic to cats and dogs.",
      "size": "6in. Pot",
      "price": 60,
      "in_stock": true,
      "rating": 5,
      "best_seller": true,
      "rarity": "uncommon"
    },
    {
      "id": "Ug5roZHlC78",
      "scientificName": "Philodendron hederaceum",
      "commonName": "Heartleaf Philodendron (Varigated)",
      "overview": "Philodendron hederaceum is a species of flowering plant in the family Araceae, native to Central America and the Caribbean which is common in the houseplant trade.",
      "description": "The philodendron Brasil is a cultivator of the popular heartleaf philodendron and is just as easy to care for. Characterized by dark green, heart-shaped leaves with splashes of variegation in shades of lime green, the Philodendron hederaceum 'Brasil' gained its common name due to its resemblance to the Brazilian flag. As a cultivator of the heartleaf philodendron, philodendron Brasil are considered mildly toxic to pets and humans.",
      "size": "6in. Pot",
      "price": 30,
      "in_stock": false,
      "rating": 5,
      "best_seller": false,
      "rarity": "uncommon"
    },
    {
      "id": "17UXXzGF7RA",
      "scientificName": "Ficus elastica",
      "commonName": "Rubber Plant (Varigated)",
      "overview": "Ficus elastica, the rubber fig, rubber bush, rubber tree, rubber plant, or Indian rubber bush, Indian rubber tree, is a species of flowering plant in the family Moraceae, native to eastern parts of South and Southeast Asia",
      "description": "A rubber tree plant is also known as a Ficus elastica. These large trees can grow up to 50 feet (15 m.) tall. When learning how to care for a rubber tree plant, there are a few key things to remember, but rubber plant care isn’t as difficult as one might think. Starting with a young rubber tree houseplant will allow it to adapt to being an indoor plant better than starting with a more mature plant.",
      "size": "6in. Pot",
      "price": 30,
      "in_stock": false,
      "rating": 4,
      "best_seller": false,
      "rarity": "uncommon"
    },
    {
      "id": "xGpYDi-0348",
      "scientificName": "Ceropegia",
      "commonName": "String of Hearts",
      "overview": "Ceropegia is a genus of plants within the family Apocynaceae, native to Africa, southern Asia, and Australia. It was named by Carl Linnaeus, who first described this genus in his Genera plantarum, which appeared in 1737.",
      "description": "The String of Hearts is a sweet and fantastic hanging plant native to South Africa, Swaziland, and Zimbabwe. Due to its dark green with variegated silver markings or in cream, pink, and green heart-shaped, patterned leaves, this magnificent succulent has stolen the hearts of many collectors. It can grow up to 2 to 3-inches tall and has purple-toned stems that can reach about 3 to 9 feet long, so make sure to hang this plant somewhere high, for you to be able to witness how breathtaking it can be, especially when it starts to cascade out of the pot like a waterfall.",
      "size": "4in. Pot",
      "price": 20,
      "in_stock": true,
      "rating": 5,
      "best_seller": true,
      "rarity": "uncommon"
    }
  ],
  "featured_products": [
    {
      "id": "enQ7lRYW-uU",
      "scientificName": "Epipremnum aureum",
      "commonName": "Snow Queen",
      "overview": "Keeping the Snow Queen pothos happy indoors is pretty straightforward. However, its care differs slightly from other pothos varieties like the golden pothos or Marble Queen pothos.",
      "description": "",
      "size": "6in. Pot",
      "price": 15,
      "in_stock": true,
      "rating": 5,
      "best_seller": true,
      "rarity": "common"
    },
    {
      "id": "bwsTJMnhcwE",
      "scientificName": "Monstera deliciosa",
      "commonName": "Swiss Cheese Plant",
      "overview": "Monstera deliciosa, the Swiss cheese plant or split-leaf philodendron is a species of flowering plant native to tropical forests of southern Mexico, south to Panama.",
      "description": "Monstera deliciosa, the Swiss cheese plant or split-leaf philodendron is a species of flowering plant native to tropical forests of southern Mexico, south to Panama. It has been introduced to many tropical areas, and has become a mildly invasive species in Hawaii, Seychelles, Ascension Island and the Society Islands",
      "size": "8in. Pot",
      "price": 80,
      "in_stock": true,
      "rating": 4,
      "best_seller": false,
      "rarity": "uncommon"
    },
    {
      "id": "N7oHWhK9UDM",
      "scientificName": "Senecio rowleyanus",
      "commonName": "String of Pearls",
      "overview": "This is a flowering plant in the daisy family Asteraceae. It is a creeping, perennial, succulent vine native to the drier parts of southwest Africa.",
      "description": "",
      "size": "4in. Pot",
      "price": 15,
      "in_stock": true,
      "rating": 5,
      "best_seller": false,
      "rarity": "common"
    }
  ],
  "orders": [
    {
      "pickList": [
        {
          "id": "enQ7lRYW-uU",
          "scientificName": "Epipremnum aureum",
          "commonName": "Snow Queen",
          "overview": "Keeping the Snow Queen pothos happy indoors is pretty straightforward. However, its care differs slightly from other pothos varieties like the golden pothos or Marble Queen pothos.",
          "description": "Epipremnum aureum as a general genus and species is native to Southeast Asia. I couldn’t find the exact origin of the snow queen variety, but my guess is that it’s somewhere around there. And it was probably a result of either a hybridized plant or a rando mutation that someone ran with. Snow queen pothos has the same familiar heart-shaped leaves that other epipremnum aureum pothos plants have. It vines and climbs, so it looks lovely in a hanging basket or climbing a moss pole. The thing that makes snow queen pothos unique and a bit more interesting than some other pothos plants, though, is its gorgeous variegation. The leaves are generally very light—nearly white—with green variegation and speckles on them. You might think, “Brittany, you’re talking about a marble queen pothos.” And I could be, because the marble queen pothos plant is very similar to the snow queen pothos plant. And it’s easy to confuse the two. But I own both, so let’s have a nosy at them!",
          "size": "6in. Pot",
          "price": 15,
          "in_stock": true,
          "rating": 5,
          "best_seller": true,
          "rarity": "common"
        },
        {
          "id": "buUOOaoUOQI",
          "scientificName": "Aglaonema Kiwi",
          "commonName": "Chinese Evergreen",
          "overview": "Aglaonema Kiwi is a sunworshipper and loves soaking up the rays. A compact clustering of green leaves with frills of white variegation, she looks good with very little effort.",
          "description": "Intense variegation and packed masses of foliage spread out from the centre of this gorgeous aglaonema variety. The leaves boast more creamy white variegation than green, and for that reason it can really flourish in that sunny spot by the window, unlike most of its shade loving cousins, where it will continue to grow brilliantly white. The green speckles that are found up the midrib and margins of the large leaves as well as across the stems work to highlight the striking brilliance of the main leaf body. This plant is found on rainforest floors around the world, and even in a packed out mass of plants it really stands out because of its unusual colouration.",
          "size": "6in. Pot",
          "price": 20,
          "in_stock": true,
          "rating": 5,
          "best_seller": false,
          "rarity": "common"
        },
        {
          "id": "xGpYDi-0348",
          "scientificName": "Ceropegia",
          "commonName": "String of Hearts",
          "overview": "Ceropegia is a genus of plants within the family Apocynaceae, native to Africa, southern Asia, and Australia. It was named by Carl Linnaeus, who first described this genus in his Genera plantarum, which appeared in 1737.",
          "description": "The String of Hearts is a sweet and fantastic hanging plant native to South Africa, Swaziland, and Zimbabwe. Due to its dark green with variegated silver markings or in cream, pink, and green heart-shaped, patterned leaves, this magnificent succulent has stolen the hearts of many collectors. It can grow up to 2 to 3-inches tall and has purple-toned stems that can reach about 3 to 9 feet long, so make sure to hang this plant somewhere high, for you to be able to witness how breathtaking it can be, especially when it starts to cascade out of the pot like a waterfall.",
          "size": "4in. Pot",
          "price": 20,
          "in_stock": true,
          "rating": 5,
          "best_seller": true,
          "rarity": "uncommon"
        }
      ],
      "amount_paid": 55,
      "quantity": 3,
      "user": {
        "name": "Example User",
        "email": "example@bloomify.com",
        "id": 1
      },
      "id": 1
    }
  ],
  "users": [
    {
      "email": "example@bloomify.com",
      "password": "$2a$10$p5n8FOyE313cgDYfHlVsVOFOZoLY/o5njA2QEW41f2ZmjeHewL7zq",
      "name": "Example User",
      "id": 1
    }
  ]
}